Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: More complex example of parsing of filenames to get the correct component and language out of a filename like ``src/security/Numerous_security_holes_in_0.10.1.de.po``:
sv: Mer komplext exempel pÃ¥ parsning av filnamn fÃ¶r att fÃ¥ fram rÃ¤tt komponent och sprÃ¥k ur ett filnamn som ``src/security/Numerous_security_holes_in_0.10.1.de.po``:

source: Filtering only translations in a chosen language:
sv: Filtrera endast Ã¶versÃ¤ttningar pÃ¥ ett valt sprÃ¥k:

source: Importing Sphinx documentation split to multiple files:
sv: Importera Sphinx-dokumentation uppdelad i flera filer:

source: Importing Sphinx documentation split to multiple files and directories:
sv: Importera Sphinx-dokumentation uppdelad i flera filer och kataloger:

source: More detailed examples can be found in the :ref:`starting` chapter, alternatively you might want to use :wladmin:`import_json`.
sv: Mer detaljerade exempel finns i kapitlet :ref:`starting`. Alternativt kan du anvÃ¤nda :wladmin:`import_json`.

source: Imports :ref:`projectbackup`.
sv: Importerar :ref:`projectbackup`.

source: Usually it is more comfortable to import project when :ref:`adding-projects`.
sv: Vanligtvis Ã¤r det bekvÃ¤mare att importera projekt nÃ¤r :ref:`adding-projects`.

source: Imports user data from a file created by :wladmin:`dumpuserdata`.
sv: Importerar anvÃ¤ndardata frÃ¥n en fil som skapats av :wladmin:`dumpuserdata`.

source: Imports users from JSON dump of the Django auth_users database.
sv: Importerar anvÃ¤ndare frÃ¥n JSON-dump av Django auth_users-databasen.

source: With this option it will just check whether a given file can be imported and report possible conflicts arising from usernames or e-mails.
sv: Med detta alternativ kontrolleras endast om en viss fil kan importeras och eventuella konflikter som uppstÃ¥r pÃ¥ grund av anvÃ¤ndarnamn eller e-postadresser rapporteras.

source: You can dump users from the existing Django site using:
sv: Du kan ta bort anvÃ¤ndare frÃ¥n den befintliga Django-webbplatsen med hjÃ¤lp av:

source: Use :wladmin:`dumpuserdata` for dumping data from other Weblate server as that includes user settings as well.
sv: AnvÃ¤nd :wladmin:`dumpuserdata` fÃ¶r att dumpa data frÃ¥n andra Weblate-servrar, eftersom det Ã¤ven inkluderar anvÃ¤ndarinstÃ¤llningar.

source: Installs an add-on to a set of components.
sv: Installerar ett tillÃ¤gg till en uppsÃ¤ttning komponenter.

source: Name of the add-on to install. For example ``weblate.gettext.customize``.
sv: Namnet pÃ¥ tillÃ¤gget som ska installeras. Till exempel ``weblate.gettext.customize``.

source: JSON encoded configuration of an add-on.
sv: JSON-kodad konfiguration av ett tillÃ¤gg.

source: Update the existing add-on configuration.
sv: Uppdatera den befintliga tillÃ¤ggskonfigurationen.

source: You can either define which project or component to install the add-on in (for example ``weblate/application``), or use ``--all`` to include all existing components.
sv: Du kan antingen ange vilket projekt eller vilken komponent tillÃ¤gget ska installeras i (till exempel ``weblate/application``), eller anvÃ¤nda ``--all`` fÃ¶r att inkludera alla befintliga komponenter.

source: To install :ref:`addon-weblate.gettext.mo` for all components:
sv: FÃ¶r att installera :ref:`addon-weblate.gettext.mo` fÃ¶r alla komponenter:

source: Installs an site-wide automatic suggestion service.
sv: Installerar en automatisk fÃ¶rslagstjÃ¤nst fÃ¶r hela webbplatsen.

source: Name of the service to install. For example ``deepl``.
sv: Namnet pÃ¥ tjÃ¤nsten som ska installeras. Till exempel ``deepl``.

source: JSON encoded configuration of a service.
sv: JSON-kodad konfiguration av en tjÃ¤nst.

source: Update the existing service configuration.
sv: Uppdatera den befintliga tjÃ¤nstekonfigurationen.

source: To install :ref:`mt-deepl`:
sv: FÃ¶r att installera :ref:`mt-deepl`:

source: Lists add-ons in reStructuredText as a template for :doc:`/admin/addons`.
sv: Listar tillÃ¤gg i reStructuredText som en mall fÃ¶r :doc:`/admin/addons`.

source: Lists permissions in reStructuredText as a template for :doc:`/admin/access`.
sv: Listar behÃ¶righeter i reStructuredText som en mall fÃ¶r :doc:`/admin/access`.

source: Lists quality checks in reStructuredText as a template for :doc:`/admin/checks` and :doc:`/user/checks`.
sv: Listar kvalitetskontroller i reStructuredText som en mall fÃ¶r :doc:`/admin/checks` och :doc:`/user/checks`.

source: Lists supported languages in MediaWiki markup - language codes, English names and localized names.
sv: Listar sprÃ¥k som stÃ¶ds i MediaWiki-markup â sprÃ¥kkoder, engelska namn och lokaliserade namn.

source: This is used to generate <https://www.l10n.cz/wiki/Slovn%C3%ADky/Slovn%C3%ADk_s_n%C3%A1zvy_jazyk%C5%AF/>.
sv: Detta anvÃ¤nds fÃ¶r att generera <https://www.l10n.cz/wiki/Slovn%C3%ADky/Slovn%C3%ADk_s_n%C3%A1zvy_jazyk%C5%AF/>.

source: Lists automatic suggestions services in reStructuredText as a template for :doc:`/admin/machine`.
sv: Listar automatiska fÃ¶rslagstjÃ¤nster i reStructuredText som en mall fÃ¶r :doc:`/admin/machine`.

source: Lists translators by contributed language for the given project:
sv: Listar Ã¶versÃ¤ttare efter bidragande sprÃ¥k fÃ¶r det angivna projektet:

source: List names by language code instead of language name.
sv: Lista namn efter sprÃ¥kkod istÃ¤llet fÃ¶r sprÃ¥knamn.

source: You can either define which project or component to use (for example ``weblate/application``), or use ``--all`` to list translators from all existing components.
sv: Du kan antingen ange vilket projekt eller vilken komponent som ska anvÃ¤ndas (till exempel ``weblate/application``) eller anvÃ¤nda ``--all`` fÃ¶r att visa Ã¶versÃ¤ttare frÃ¥n alla befintliga komponenter.

source: Lists all Weblate dependencies and their versions.
sv: Visar alla Weblate-beroenden och deras versioner.

source: Lists File format parameters.
sv: Listar filformatsparametrar.

source: Reloads translations from disk (for example in case you have done some updates in the VCS repository).
sv: Laddar om Ã¶versÃ¤ttningar frÃ¥n disken (till exempel om du har gjort nÃ¥gra uppdateringar i VCS-arkivet).

source: Force update, even if the files should be up-to-date.
sv: Tvinga uppdatering, Ã¤ven om filerna borde vara uppdaterade.

source: Limit processing to a single language.
sv: BegrÃ¤nsa bearbetningen till ett enda sprÃ¥k.

source: You seldom need to invoke this, Weblate will automatically load changed files for every VCS update. This is needed in case you manually changed an underlying Weblate VCS repository or in some special cases following an upgrade.
sv: Du behÃ¶ver sÃ¤llan anvÃ¤nda detta, eftersom Weblate automatiskt laddar Ã¤ndrade filer vid varje VCS-uppdatering. Detta behÃ¶vs om du manuellt har Ã¤ndrat ett underliggande Weblate VCS-arkiv eller i vissa specialfall efter en uppgradering.

source: Prevents further translation of a component.
sv: FÃ¶rhindrar ytterligare Ã¶versÃ¤ttning av en komponent.

source: Useful in case you want to do some maintenance on the underlying repository.
sv: AnvÃ¤ndbart om du vill utfÃ¶ra underhÃ¥ll pÃ¥ det underliggande arkivet.

source: Migrates database to current Weblate schema. The command line options are described at Django :djadmin:`django:migrate`.
sv: Migrerar databasen till det aktuella Weblate-schemat. Kommandoradsalternativen beskrivs pÃ¥ Django :djadmin:`django:migrate`.

source: In case you want to run an installation non interactively, you can use :samp:`weblate migrate --noinput`, and then create an admin user using :wladmin:`createadmin` command.
sv: Om du vill kÃ¶ra en installation icke-interaktivt kan du anvÃ¤nda :samp:`weblate migrate --noinput` och sedan skapa en administratÃ¶rsanvÃ¤ndare med kommandot :wladmin:`createadmin`.

source: Allows you to merge language content. This is useful when updating to a new version which contains aliases for previously unknown languages that have been created with the :samp:`(generated)` suffix. It moves all content from the `source` language to the `target` one.
sv: GÃ¶r det mÃ¶jligt att slÃ¥ samman sprÃ¥kinnehÃ¥ll. Detta Ã¤r anvÃ¤ndbart nÃ¤r du uppdaterar till en ny version som innehÃ¥ller alias fÃ¶r tidigare okÃ¤nda sprÃ¥k som har skapats med suffixet :samp:`(generated)`. Det flyttar allt innehÃ¥ll frÃ¥n `kÃ¤llsprÃ¥ket` till `mÃ¥lsprÃ¥ket`.

source: After moving the content, you should check whether there is anything left (this is subject to race conditions when somebody updates the repository meanwhile) and remove the :samp:`(generated)` language.
sv: Efter att ha flyttat innehÃ¥llet bÃ¶r du kontrollera om nÃ¥got finns kvar (detta Ã¤r fÃ¶remÃ¥l fÃ¶r race conditions om nÃ¥gon uppdaterar arkivet under tiden) och ta bort sprÃ¥ket :samp:`(generated)`.

source: Pushes committed changes to the upstream VCS repository.
sv: Skickar bekrÃ¤ftade Ã¤ndringar till uppstrÃ¶ms VCS-arkivet.

source: Force commits any pending changes, prior to pushing.
sv: Force bekrÃ¤ftar alla vÃ¤ntande Ã¤ndringar innan de skickas.

source: Weblate pushes changes automatically if :ref:`component-push_on_commit` in :ref:`component` is turned on, which is the default.
sv: Weblate skickar automatiskt Ã¤ndringar om :ref:`component-push_on_commit` i :ref:`component` Ã¤r aktiverat, vilket Ã¤r standardinstÃ¤llningen.

source: Unlocks a given component, making it available for translation.
sv: LÃ¥ser upp en viss komponent och gÃ¶r den tillgÃ¤nglig fÃ¶r Ã¶versÃ¤ttning.

source: Configures default groups and optionally assigns all users to that default group.
sv: Konfigurerar standardgrupper och tilldelar valfritt alla anvÃ¤ndare till den standardgruppen.

source: Turns off automatic updating of existing groups (only adds new ones).
sv: StÃ¤nger av automatisk uppdatering av befintliga grupper (lÃ¤gger endast till nya).

source: Prevents automatic updates of groups for existing projects. This allows adding newly added groups to existing projects, see :ref:`acl`.
sv: FÃ¶rhindrar automatiska uppdateringar av grupper fÃ¶r befintliga projekt. Detta gÃ¶r det mÃ¶jligt att lÃ¤gga till nyligen tillagda grupper till befintliga projekt, se :ref:`acl`.

source: Updates list of defined languages in Weblate.
sv: Uppdaterar listan Ã¶ver definierade sprÃ¥k i Weblate.

source: Turns off automatic updates of existing languages (only adds new ones).
sv: StÃ¤nger av automatiska uppdateringar av befintliga sprÃ¥k (lÃ¤gger endast till nya).

source: Updates all checks for all strings.
sv: Uppdaterar alla kontroller fÃ¶r alla strÃ¤ngar.

source: Useful for upgrades which do major changes to checks.
sv: AnvÃ¤ndbart fÃ¶r uppgraderingar som innebÃ¤r stÃ¶rre fÃ¶rÃ¤ndringar av kontroller.

source: Checks are recalculated regularly by Weblate in the background, the frequency can be configured via :setting:`BACKGROUND_TASKS`.
sv: Kontroller berÃ¤knas regelbundet av Weblate i bakgrunden. Frekvensen kan konfigureras via :setting:`BACKGROUND_TASKS`.

source: Fetches remote VCS repositories and updates the internal cache.
sv: HÃ¤mtar fjÃ¤rr-VCS-arkiv och uppdaterar den interna cachen.

source: Usually it is better to configure hooks in the repository to trigger :ref:`hooks`, instead of regular triggering the updates by :wladmin:`updategit`.
sv: Vanligtvis Ã¤r det bÃ¤ttre att konfigurera krokar i arkivet fÃ¶r att utlÃ¶sa :ref:`hooks`, istÃ¤llet fÃ¶r att regelbundet utlÃ¶sa uppdateringar med :wladmin:`updategit`.

source: Translation Memory
sv: ÃversÃ¤ttningsminne

source: Weblate comes with a built-in translation memory consisting of:
sv: Weblate har ett inbyggt Ã¶versÃ¤ttningsminne som bestÃ¥r av:

source: Manually imported translation memory (see :ref:`memory-user`).
sv: Manuellt importerat Ã¶versÃ¤ttningsminne (se :ref:`memory-user`).

source: Automatically stored translations performed in Weblate (depending on :ref:`memory-scopes`).
sv: ÃversÃ¤ttningar som automatiskt lagras i Weblate (beroende pÃ¥ :ref:`memory-scopes`).

source: Automatically imported past translations.
sv: Tidigare Ã¶versÃ¤ttningar importeras automatiskt.

source: Content in the translation memory can be applied to strings in several ways:
sv: InnehÃ¥llet i Ã¶versÃ¤ttningsminnet kan tillÃ¤mpas pÃ¥ strÃ¤ngar pÃ¥ flera sÃ¤tt:

source: User can accept suggestions from the :ref:`machine-translation` tab while editing the string.
sv: AnvÃ¤ndaren kan acceptera fÃ¶rslag frÃ¥n fliken :ref:`machine-translation` medan strÃ¤ngen redigeras.

source: The selected strings can be processed using :ref:`auto-translation` from the :guilabel:`Operations` menu.
sv: De valda strÃ¤ngarna kan bearbetas med hjÃ¤lp av :ref:`auto-translation` frÃ¥n menyn :guilabel:`Operations`.

source: :ref:`addon-weblate.autotranslate.autotranslate` add-on can automatically apply changes to new and existing strings.
sv: :ref:`addon-weblate.autotranslate.autotranslate`-tillÃ¤gget kan automatiskt tillÃ¤mpa Ã¤ndringar pÃ¥ nya och befintliga strÃ¤ngar.

source: For installation tips, see :ref:`mt-weblate-translation-memory`, which is turned on by default.
sv: FÃ¶r installationstips, se :ref:`mt-weblate-translation-memory`, som Ã¤r aktiverat som standard.

source: Translation-memory scopes
sv: ÃversÃ¤ttningsminnesomfÃ¥ng

source: The translation-memory scopes ensure privacy for different projects and users. Sharing of translations is also available.
sv: ÃversÃ¤ttningsminnets omfattning sÃ¤kerstÃ¤ller sekretess fÃ¶r olika projekt och anvÃ¤ndare. Det gÃ¥r ocksÃ¥ att dela Ã¶versÃ¤ttningar.

source: Imported translation memory
sv: Importerat Ã¶versÃ¤ttningsminne

source: Importing arbitrary translation memory data using the :wladmin:`import_memory` command makes memory content available to all users and projects.
sv: Genom att importera godtyckliga Ã¶versÃ¤ttningsminnesdata med kommandot :wladmin:`import_memory` blir minnesinnehÃ¥llet tillgÃ¤ngligt fÃ¶r alla anvÃ¤ndare och projekt.

source: Per-user translation memory
sv: ÃversÃ¤ttningsminne per anvÃ¤ndare

source: Stores all user translations automatically in the personal translation memory of each respective user.
sv: Lagrar alla anvÃ¤ndarÃ¶versÃ¤ttningar automatiskt i varje respektive anvÃ¤ndares personliga Ã¶versÃ¤ttningsminne.

source: Per-project translation memory
sv: ÃversÃ¤ttningsminne per projekt

source: All translations within a project are automatically stored in a project translation memory only available for this project.
sv: Alla Ã¶versÃ¤ttningar inom ett projekt sparas automatiskt i ett projektÃ¶versÃ¤ttningsminne som endast Ã¤r tillgÃ¤ngligt fÃ¶r detta projekt.

source: All translations within projects with shared translation memory turned on are stored in a shared translation memory available to all projects.
sv: Alla Ã¶versÃ¤ttningar inom projekt med delat Ã¶versÃ¤ttningsminne aktiverat lagras i ett delat Ã¶versÃ¤ttningsminne som Ã¤r tillgÃ¤ngligt fÃ¶r alla projekt.

source: Please consider carefully whether to turn this feature on for shared Weblate installations, as it can have severe implications:
sv: TÃ¤nk noga igenom om du vill aktivera den hÃ¤r funktionen fÃ¶r delade Weblate-installationer, eftersom det kan fÃ¥ allvarliga konsekvenser:

source: The translations can be used by anybody else.
sv: ÃversÃ¤ttningarna kan anvÃ¤ndas av vem som helst.

source: This might lead to disclosing secret information.
sv: Detta kan leda till att hemlig information avslÃ¶jas.

source: Make sure the translations you share have good quality.
sv: Se till att de Ã¶versÃ¤ttningar du delar Ã¤r av god kvalitet.

source: Translation memory entries can have two different statuses: **active** and **pending**. Pending entries are included in suggestions, but with a quality penalty applied. If :ref:`autoclean-tm` is enabled, stale and obsolete entries with pending status are automatically removed when a translation is approved.
sv: ÃversÃ¤ttningsminnesposter kan ha tvÃ¥ olika statusar: **aktiv** och **vÃ¤ntande**. VÃ¤ntande poster ingÃ¥r i fÃ¶rslagen, men med en kvalitetsavdrag. Om :ref:`autoclean-tm` Ã¤r aktiverat tas gamla och fÃ¶rÃ¥ldrade poster med vÃ¤ntande status automatiskt bort nÃ¤r en Ã¶versÃ¤ttning godkÃ¤nns.

source: The translation memory is automatically cleaned up by removing obsolete and outdated entries.
sv: ÃversÃ¤ttningsminnet rensas automatiskt genom att fÃ¶rÃ¥ldrade och inaktuella poster tas bort.

source: In the Docker container this can be configured using :envvar:`WEBLATE_DEFAULT_AUTOCLEAN_TM`.
sv: I Docker-containern kan detta konfigureras med hjÃ¤lp av :envvar:`WEBLATE_DEFAULT_AUTOCLEAN_TM`.

source: Managing the Translation Memory
sv: Hantera Ã¶versÃ¤ttningsminnet

source: User interface
sv: AnvÃ¤ndargrÃ¤nssnitt

source: Personal translation memory management is available by clicking the user avatar in the top-right corner of the UI and selecting "Translation memory" from the dropdown menu. Entries attributed to the user are listed in scopes â total, for each respective project, component, or language contributed to, with options to download (as JSON, or TMX) or delete them.
sv: Personlig Ã¶versÃ¤ttningsminneshantering Ã¤r tillgÃ¤nglig genom att klicka pÃ¥ anvÃ¤ndarens avatar i det Ã¶vre hÃ¶gra hÃ¶rnet av anvÃ¤ndargrÃ¤nssnittet och vÃ¤lja "ÃversÃ¤ttningsminne" frÃ¥n rullgardinsmenyn. Poster som tillskrivs anvÃ¤ndaren listas i olika omrÃ¥den â totalt, fÃ¶r respektive projekt, komponent eller sprÃ¥k som bidragit till, med alternativ fÃ¶r att ladda ner (som JSON eller TMX) eller radera dem.

source: In the basic user interface you can manage per-user and per-project translation memories. It can be used to download, wipe or import translation memory.
sv: I det grundlÃ¤ggande anvÃ¤ndargrÃ¤nssnittet kan du hantera Ã¶versÃ¤ttningsminnen per anvÃ¤ndare och per projekt. Det kan anvÃ¤ndas fÃ¶r att ladda ner, radera eller importera Ã¶versÃ¤ttningsminnen.

source: There are multiple options to download the translation memory of the whole instance.
sv: Det finns flera alternativ fÃ¶r att ladda ner Ã¶versÃ¤ttningsminnet fÃ¶r hela instansen.

source: Translation memories in various formats can be imported into Weblate, the TMX format is provided for interoperability with other tools. All supported formats are TMX, JSON, XLIFF, PO, CSV.
sv: ÃversÃ¤ttningsminnen i olika format kan importeras till Weblate, TMX-formatet tillhandahÃ¥lls fÃ¶r interoperabilitet med andra verktyg. Alla format som stÃ¶ds Ã¤r TMX, JSON, XLIFF, PO, CSV.

source: You can search for translations in the view built for this.
sv: Du kan sÃ¶ka efter Ã¶versÃ¤ttningar i den vy som skapats fÃ¶r detta Ã¤ndamÃ¥l.

source: Admin interface
sv: AdministratÃ¶rsgrÃ¤nssnitt

source: There is a platform-wide interface to manage the translation memory.
sv: Det finns ett plattformsÃ¶vergripande grÃ¤nssnitt fÃ¶r att hantera Ã¶versÃ¤ttningsminnet.

source: It has the same options as the user interface, but also allows rebuilding parts of or the entire translation memory. All old entries can be flushed and re-created from a component or project by selecting "Administration" from amidst the different tabs at the top of the screen, and then "Translation memory".
sv: Den har samma alternativ som anvÃ¤ndargrÃ¤nssnittet, men gÃ¶r det ocksÃ¥ mÃ¶jligt att Ã¥teruppbygga delar av eller hela Ã¶versÃ¤ttningsminnet. Alla gamla poster kan rensas och skapas om frÃ¥n en komponent eller ett projekt genom att vÃ¤lja "Administration" bland de olika flikarna hÃ¶gst upp pÃ¥ skÃ¤rmen och sedan "ÃversÃ¤ttningsminne".

source: Several management commands can manipulate translation memory content. These operate on the translation memory as a whole, unfiltered by scopes (unless requested by parameters):
sv: Flera hanteringskommandon kan manipulera innehÃ¥llet i Ã¶versÃ¤ttningsminnet. Dessa fungerar pÃ¥ Ã¶versÃ¤ttningsminnet som helhet, utan att filtreras av omfattningar (om inte parametrarna krÃ¤ver det):

source: Exports the memory into JSON
sv: Exporterar minnet till JSON

source: Imports TMX or JSON files into the translation memory
sv: Importerar TMX- eller JSON-filer till Ã¶versÃ¤ttningsminnet

source: Removes all entries with pending status from the translation memory
sv: Tar bort alla poster med status "vÃ¤ntande" frÃ¥n Ã¶versÃ¤ttningsminnet

source: The Weblate API covers the translation memory. This allows automated manipulation for different purposes, or based on events in the translation cycle.
sv: Weblate API omfattar Ã¶versÃ¤ttningsminnet. Detta mÃ¶jliggÃ¶r automatiserad bearbetning fÃ¶r olika Ã¤ndamÃ¥l eller baserat pÃ¥ hÃ¤ndelser i Ã¶versÃ¤ttningscykeln.

source: Optional Weblate modules
sv: Valfria Weblate-moduler

source: Several optional modules are available for your setup.
sv: Flera valfria moduler finns tillgÃ¤ngliga fÃ¶r din installation.

source: Git exporter
sv: Git-exportÃ¶r

source: Provides you read-only access to the underlying Git repository using HTTP(S).
sv: Ger dig lÃ¤sbehÃ¶righet till det underliggande Git-arkivet via HTTP(S).

source: Add ``weblate.gitexport`` to installed apps in :file:`settings.py`:
sv: LÃ¤gg till ``weblate.gitexport`` till installerade appar i :file:`settings.py`:

source: Export existing repositories by migrating your database after installation:
sv: Exportera befintliga arkiv genom att migrera din databas efter installationen:

source: Git exporter is turned on in our official Docker image. To turn it of, use:
sv: Git-exportÃ¶ren Ã¤r aktiverad i vÃ¥r officiella Docker-bild. FÃ¶r att inaktivera den, anvÃ¤nd:

source: The module automatically hooks into Weblate and sets the exported repository URL in the :ref:`component`. The repositories are accessible under the ``/git/`` part of the Weblate URL, for example ``https://example.org/git/weblate/main/``.
sv: Modulen kopplas automatiskt till Weblate och stÃ¤ller in den exporterade repositoriets URL i :ref:`component`. Repositorierna Ã¤r tillgÃ¤ngliga under ``/git/``-delen av Weblate-URL:en, till exempel ``https://example.org/git/weblate/main/``.

source: Repositories for publicly available projects can be cloned without authentication:
sv: Repositorier fÃ¶r offentligt tillgÃ¤ngliga projekt kan klonas utan autentisering:

source: Access to browse the repositories with restricted access (with `Private` :ref:`access control <acl>` or when :setting:`REQUIRE_LOGIN` is enabled) requires an API token which can be obtained in your :ref:`user profile <user-profile>`:
sv: FÃ¶r att kunna blÃ¤ddra i arkiven med begrÃ¤nsad Ã¥tkomst (med `Private` :ref:`Ã¥tkomstkontroll <acl>` eller nÃ¤r :setting:`REQUIRE_LOGIN` Ã¤r aktiverat) krÃ¤vs en API-token som kan erhÃ¥llas i din :ref:`anvÃ¤ndarprofil <user-profile>`:

source: By default members or :guilabel:`Users` group and anonymous user have access to the repositories for public projects via :guilabel:`Access repository` and :guilabel:`Power user` roles.
sv: Som standard har medlemmar eller :guilabel:`AnvÃ¤ndare`-gruppen och anonyma anvÃ¤ndare Ã¥tkomst till arkiven fÃ¶r offentliga projekt via :guilabel:`Ã tkomst till arkiv` och :guilabel:`Power user`-roller.

source: This is used on `Hosted Weblate <https://weblate.org/hosting/>`_ to define billing plans, track invoices and usage limits.
sv: Detta anvÃ¤nds pÃ¥ `Hosted Weblate <https://weblate.org/hosting/>`_ fÃ¶r att definiera faktureringsplaner, spÃ¥ra fakturor och anvÃ¤ndningsgrÃ¤nser.

source: 1. Add ``weblate.billing`` to installed apps in :file:`settings.py`:
sv: 1. LÃ¤gg till ``weblate.billing`` till installerade appar i :file:`settings.py`:

source: Run the database migration to optionally install additional database structures for the module:
sv: KÃ¶r databasmigreringen fÃ¶r att eventuellt installera ytterligare databasstrukturer fÃ¶r modulen:

source: Billing plan creation and assignment
sv: Skapande och tilldelning av faktureringsplaner
